Resources/RequestPayload.txt

<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>4f22ec46b61c460b8fed0d3e26f834c9</tem:apiSessionId>
    <tem:qflowCustomerId>22293063</tem:qflowCustomerId>
    <tem:remoteId>1061265219</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>1ca7fb111b1f4aecb2f69e79c1e8e650</tem:apiSessionId>
    <tem:qflowCustomerId>22293064</tem:qflowCustomerId>
    <tem:remoteId>1061265250</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>6f244d3f95274604a01c9949f711a0e4</tem:apiSessionId>
    <tem:qflowCustomerId>22293065</tem:qflowCustomerId>
    <tem:remoteId>1061265284</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>76dcd0ec2c87461aaeb63926d6fe70b0</tem:apiSessionId>
    <tem:qflowCustomerId>22293067</tem:qflowCustomerId>
    <tem:remoteId>1061265359</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>5d24b7d054a047ed85a9da40f14ddf01</tem:apiSessionId>
    <tem:qflowCustomerId>22293019</tem:qflowCustomerId>
    <tem:remoteId>1068508306</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>ba5bd70436c54ffe8c425e4f7c89d804</tem:apiSessionId>
    <tem:qflowCustomerId>22293068</tem:qflowCustomerId>
    <tem:remoteId>1063930588</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>955c431d557b4b64a2cdf96a3d737ced</tem:apiSessionId>
    <tem:qflowCustomerId>22293069</tem:qflowCustomerId>
    <tem:remoteId>1068507902</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>0f69bd724d234530a520456d3077b42a</tem:apiSessionId>
    <tem:qflowCustomerId>22293070</tem:qflowCustomerId>
    <tem:remoteId>1063930703</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>f309d2204a734981a786403f60f7cf1a</tem:apiSessionId>
    <tem:qflowCustomerId>22293071</tem:qflowCustomerId>
    <tem:remoteId>1068507944</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>646fe6935a5345e781d292312a2c1d2b</tem:apiSessionId>
    <tem:qflowCustomerId>22293072</tem:qflowCustomerId>
    <tem:remoteId>1068507951</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>7c7a5fbd88d249ffbea50bb670e309f0</tem:apiSessionId>
    <tem:qflowCustomerId>22293073</tem:qflowCustomerId>
    <tem:remoteId>1061265672</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>9bf1bd5b872241b4aeb02bea11e03b15</tem:apiSessionId>
    <tem:qflowCustomerId>22293074</tem:qflowCustomerId>
    <tem:remoteId>1061265698</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>4ac381bc5c44454da596eb309c8f4000</tem:apiSessionId>
    <tem:qflowCustomerId>22293075</tem:qflowCustomerId>
    <tem:remoteId>1061265730</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>b4a840953fd54184b546dcd129b04f8a</tem:apiSessionId>
    <tem:qflowCustomerId>22293076</tem:qflowCustomerId>
    <tem:remoteId>1061265755</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>b96333ad3271479aa813063d4663b63b</tem:apiSessionId>
    <tem:qflowCustomerId>22293077</tem:qflowCustomerId>
    <tem:remoteId>1061265805</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>
